perf/ramp-timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/timeout'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/timeout'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: "Clear start"
      pause: 30
    - name: "300 rps"
      duration: 120
      arrivalRate: 300
    - name: "Clear end"
      pause: 30

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'